##### Linux命令--系统管理

###### cal 
- 查看当前日历
- cal -y 表示：显示整年日历
###### date 
- 显示或设置时间
- 设置时间格式（需要管理员权限）（了解就好）：
- date [MMDDhhmm[[CC]YY][.ss]] +format
	- 注：CC为年前两位yy为年的后两位ie，前两位的mm为月，后两位的mm为分钟，dd为天，hh为小时，ss为秒。
   	- 如： date 010203042016.55
- 显示时间格式（date'+%y,%m,%d,%H,%M,%s'）

###### ps
- 查看进程信息
- 常用选项：
	- ps -a	显示终端上的所有进程，包括其他用户的进程
	- ps -u	显示进程的详细状态
	- ps -x	显示没有控制终端的进程
	- ps -w	显示加宽，以便显示更多信息
	- ps -r 只显示正在运行的进程

###### top 
- 动态显示运行中的进程。可以使用 top 命令时加上 -d 来指定显示信息更新的时间间隔。
- 在 top 命令执行后，可以按下按键得到对显示的结果排序：
	- M	根据内存使用量来排序
	- P	根据CPU占有率来排序
	- T	根据进程运行时间的长短来排序
	- U	可以根据后面输入的用户名来筛选进程
	- K	可以根据后面输入的 PID 来杀死进程
	- q	退出

###### kill 
- 终止进程(kill 命令指定进程号的进程，需要配合 ps 来使用）
- 使用格式： kill [-signal] pid
- 如果一个进程杀不死，可以用：kill -9 进程号（PID）

###### 关机重启 
- reboot、shutdown、init
- 常用操作：
	- reboot 重新启动操作系统
	- shutdown -r now 重新启动操作系统，shutdown 会给别的用户提示
	- shutdoen -h now 立刻关机，其中 now 相当于时间为0的状态 
	- shutdown -h 20:25 系统在今天的20：25会关机
	- shutdown -h +10 系统再过十分钟后自动关机
	- init 0 关机
	- init 6 重启

###### df 
- 用于检测文件系统的磁盘空间占用集空余情况，可以显示所有文件系统对节点和磁盘块的使用情况
- 常用操作：
	- df -a 显示所有文件系统的磁盘使用情况
	- df -m 以1024字节为单位显示
	- df -t 显示各指定文件系统的磁盘空间和使用情况
	- df -T 显示文件系统

###### du 
- 用于统计目录或文件所占磁盘空间的大小，该命令的执行结果与 df 类似，du 更侧重于磁盘的使用情况
- 使用格式： du [选项] 目录或文件
- 常配合和使用的选项：
	- du -a 递归显示指定目录中各文件和子目录中文件占用的数据块
	- du -s 显示指定文件或目录占用的数据块
	- du -b 以字节文单位显示磁盘占用情况
	- du -i 计算所有文件的大小，对硬链接文件计算多次

###### "./configure --prefix"的作用
- 源码的安装一般由3个步骤组成：配置(configure)、编译(make)、安装(make install)。
- Configure是一个可执行脚本，它有很多选项，在待安装的源码路径下使用命令./configure –help输出详细的选项列表。
- 其中--prefix选项是配置安装的路径，如果不配置该选项，安装后可执行文件默认放在/usr/local/bin，库文件默认放在/usr/local/lib，配置文件默认放在/usr/local/etc，其它的资源文件放在/usr/local/share，比较凌乱。
- 配置--prefix：
	- ./configure --prefix=/usr/local/test
	- 可以把所有资源文件放在/usr/local/test的路径中，不会杂乱。
	- 用了—prefix选项的另一个好处是卸载软件或移植软件。当某个安装的软件不再需要时，只须简单的删除该安装目录，就可以把软件卸载得干干净净；移植软件只需拷贝整个目录到另外一个机器即可（相同的操作系统）。
	- 当然要卸载程序，也可以在原来的make目录下用一次make uninstall，但前提是make文件指定过uninstall

- 总结：
	- ./configure --prefix 命令将下载的要安装的源码，指定路径安装；
	- 如： ./configure --prefix=/usr/local/bin













